#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_vpc.main: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
data.aws_subnet.public_1: Reading...
data.aws_subnet.public_3: Reading...
data.aws_subnet.public_2: Reading...
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
data.aws_iam_policy_document.lambda_permissions: Reading...
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=2124571330]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=2690255455]
data.aws_subnet.public_1: Read complete after 0s [id=subnet-0679d4b1f9e7839ef]
data.aws_subnet.public_2: Read complete after 0s [id=subnet-0f10662561eade8c3]
data.aws_subnet.public_3: Read complete after 0s [id=subnet-0aed07ac008a10da9]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
data.aws_vpc.main: Read complete after 1s [id=vpc-0adcb6a62ca552c01]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_s3_policy will be created
  + resource "aws_iam_policy" "lambda_s3_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "c18-data-getter-lambda-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::c18-trend-getter-s3/*",
                          + "arn:aws:s3:::c18-trend-getter-s3",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:eu-west-2:129033205317:identity/trendgetterupdates@gmail.com"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "c18-data-getter-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_s3_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "c18-data-getter-lambda-role"
    }

  # aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-trend-getter-lambda-function"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/trend-getter-lambda-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 7168
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = null
              + "DB_NAME"     = null
              + "DB_PASSWORD" = (sensitive value)
              + "DB_PORT"     = null
              + "DB_SCHEMA"   = "bluesky"
              + "DB_USER"     = "trendgetter"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @KirstineInvierno, Action: `pull_request`*